#+TITLE: Demo project development guide
#+PROPERTY: header-args:elisp :results silent

*** Don't call us, we'll call you
- Easy to grasp and understand
#+BEGIN_SRC jshell 
void makeHttpRequest(String url, Consumer<String> handleBody) {
    System.out.println("Pretending a request to " + url);
    handleBody.accept("Here's your body!");
}
#+END_SRC

#+RESULTS:

#+BEGIN_SRC jshell
makeHttpRequest("http://test", body -> {
    for (int i = 0; i < 1; i++) {
        System.out.println("Got a results: " + body);
    };
});
#+END_SRC

#+RESULTS:
: Pretending a request to http://test
: Got a results: Here's your body!
*** CompletableFuture examples
Let's say we have a slow background computation
#+BEGIN_SRC jshell
CompletableFuture<Integer> compute(int input) {
    return CompletableFuture.supplyAsync(() -> {
        System.out.println("Starting computation for " + input);
        try { Thread.sleep(200); } catch (InterruptedException x) {}
        return input * input;
    });
}
#+END_SRC

#+RESULTS:

We can turn it into a string once the computation completes:

#+BEGIN_SRC jshell
CompletableFuture<String> willbe = compute(4).thenApply(i -> i.toString());
System.out.println("Printing now!");
System.out.println(willbe.get());
#+END_SRC

#+RESULTS:
: Starting computation for 4
: Printing now!
: 16
*** CompletableFuture examples
We can also wait on another computation, when the first one completes:
#+BEGIN_SRC jshell
CompletableFuture<Integer> composed = compute(4).thenCompose(i -> compute(i));
System.out.println(composed.get());
#+END_SRC

#+RESULTS:
: Starting computation for 4
: Starting computation for 16
: 256
*** Hello, streams
Let's do a hello world with some numbers:
#+BEGIN_SRC jshell
ActorSystem system = ActorSystem.create("QuickStart");
Materializer materializer = ActorMaterializer.create(system);

Source<Integer, NotUsed> numbers = Source.range(1, 3);

Sink<Integer, CompletionStage<Done>> print =
    Sink.foreach(i -> System.out.println(i));

CompletionStage<Done> done = numbers.runWith(print, materializer);

done.toCompletableFuture().get();
#+END_SRC

#+RESULTS:
: Done
: 1
: 2
: 3

*** Reusable pieces
- =Source=, =Sink= and =Flow= are all normal, immutable objects, so they're ideal to be constructed in reusable factory methods:
#+BEGIN_SRC jshell
public Sink<String, CompletionStage<IOResult>> lineSink(String filename) {
  Sink<ByteString, CompletionStage<IOResult>> file = FileIO.toPath(Paths.get(filename));

  return Flow.of(String.class)
    .map(s -> ByteString.fromString(s + "\n"))
    .toMat(file, Keep.right());
}
#+END_SRC

#+RESULTS:

Let's write our numbers to a file!
#+BEGIN_SRC jshell
numbers
  .map(i -> i.toString())
  .runWith(lineSink("/tmp/numbers.txt"), materializer).toCompletableFuture().get();
#+END_SRC

#+RESULTS:
: IOResult(6,Success(Done))

